# How to fetch first row of each group using pandas ?

In [3]:
import numpy as np
import pandas as pd

### Creating Scenario

In [28]:
# Dummy Data
df = pd.DataFrame({"Year":['2019', '2019', '2019', '2019', 
                           '2018', '2018', '2018', '2018', 
                           '2017','2017', '2017', '2017'],
                  "Quarter":[1,2,3,4,
                             1,2,3,4,
                             1,2,3,4],
                  "Sales":[5000, 6000, 2000, 3000, 
                           2300, 1400, 5400, 6200,
                           7230, 5600, 3200, 1600]})
df

    Year  Quarter  Sales
0   2019        1   5000
1   2019        2   6000
2   2019        3   2000
3   2019        4   3000
4   2018        1   2300
5   2018        2   1400
6   2018        3   5400
7   2018        4   6200
8   2017        1   7230
9   2017        2   5600
10  2017        3   3200
11  2017        4   1600

In [13]:
df.groupby("Year").head(1)

   Year  Quarter  Sales
0  2019        1   5000
4  2018        1   2300
8  2017        1   7230

In [20]:
df.groupby("Year").first()

      Quarter  Sales
Year
2017        1   7230
2018        1   2300
2019        1   5000

In [21]:
df.groupby("Year").nth(0)

      Quarter  Sales
Year
2017        1   7230
2018        1   2300
2019        1   5000